In [54]:
import numpy as np
import pandas as pd

In [55]:
from sklearn.metrics import classification_report 
from sklearn.model_selection import train_test_split 
import pandas as pd 
from sklearn.ensemble import RandomForestClassifier 
from sklearn.model_selection import GridSearchCV, RandomizedSearchCV

In [56]:
df1 = pd.DataFrame({
    'Nom': ['John', 'Jack', 'Steve', 'Sarah'],
    'Âge': [24, 32, 19, 29],
    'Genre': ['M', 'M', 'M', 'F']
})

In [57]:
df1

     Nom  Âge Genre
0   John   24     M
1   Jack   32     M
2  Steve   19     M
3  Sarah   29     F

In [58]:
# Création du DataFrame 2
df2 = pd.DataFrame({
    'Nom': ['re', 'Jack', 'St', 'rah'],
    'Âge': [24, 43, 19, 9],
    'Genre': ['M', 'f', 'M', 'F']
})

In [59]:
df2

    Nom  Âge Genre
0    re   24     M
1  Jack   43     f
2    St   19     M
3   rah    9     F

In [60]:
# Concaténation verticale
df3 = pd.concat([df1, df2], axis=0, ignore_index=True)

In [61]:
df3

     Nom  Âge Genre
0   John   24     M
1   Jack   32     M
2  Steve   19     M
3  Sarah   29     F
4     re   24     M
5   Jack   43     f
6     St   19     M
7    rah    9     F